#### InCanvasControlData Members

---

|  |
| --- |
| InCanvasControlData Class   Constructors   Methods   Properties   See Also |

The  InCanvasControlData  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | InCanvasControlData(String) | Constructs an InCanvasControlData with specific values assigned. |
| Public method | InCanvasControlData(String, XYZ) | Constructs an InCanvasControlData with specific values assigned. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  InCanvasControlData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ImagePath | The path to the image file to be used. This must be an absolute path to a location on disk. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Position | The position of the in-canvas control in model coordinates. |

# See Also

InCanvasControlData Class

Autodesk.Revit.DB Namespace